<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"e064bc25a37f7a42898075fc518f252a766fe0edc62be79fa9cc08dc513536ae","plan_job_ref":"Job PR Plan #25 at https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812916971","plan_out_hash":"c5cdc8fa07b87383abe942133073606a1cc3af329c503de161ca31c05f877ef4","plan_hash":"082321669670dc79a8bda2bdbeaf0b456fd185431440f186efc5fededb9ec35d","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.bar will be created
+   resource "local_file" "bar" {
+       content              = "bar!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./bar.foo"
+       id                   = (known after apply)
    }

  # local_file.foo will be created
+   resource "local_file" "foo" {
+       content              = "foo!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./foo.bar"
+       id                   = (known after apply)
    }

  # local_file.test will be created
+   resource "local_file" "test" {
+       content              = "test"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./test.txt"
+       id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   example_output_homedir = false
```
</details>

:memo: Plan generated in [PR Plan #25](https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812916971)